Revit 2016 API
Application.ObjectFactory Property
Provides an object that can be used to create other instances of Autodesk Revit API objects.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public ObjectFactory ObjectFactory { get; }
Visual Basic
Public ReadOnly Property ObjectFactory As ObjectFactory
	Get
Visual C++
public:
property ObjectFactory^ ObjectFactory {
	ObjectFactory^ get ();
}
Remarks
Returns an object factory object that can create other objects. This property is available for advanced use cases only. For general purpose creation of Autodesk Revit API objects use the Application.Create object.
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace